lkesteloot/alice/alice3/io_board/stm32f4/ioboard.c
    halted = !HAL_GPIO_ReadPin(BUS_HALT_PORT, BUS_HALT_PIN_MASK);
    if(halted != was_halted) {
        gOutputDevices = OUTPUT_TO_VIDEO | OUTPUT_TO_SERIAL;
        if(halted) {
            logprintf(DEBUG_EVENTS, "Z80 has HALTed.\n");
        } else {
            logprintf(DEBUG_EVENTS, "Z80 has exited HALT state.\n");
        }
        gOutputDevices = OUTPUT_TO_SERIAL;
        was_halted = halted;
    }
}

void check_and_process_soft_reset()
{
    if(HAL_GPIO_ReadPin(RESET_BUTTON_PORT, RESET_BUTTON_PIN_MASK)) {
        while(HAL_GPIO_ReadPin(RESET_BUTTON_PORT, RESET_BUTTON_PIN_MASK));
        delay_ms(RESET_BUTTON_DELAY_MS);// software debounce

        Z80_reset();

        logprintf(DEBUG_EVENTS, "Z80 was reset\n");
    }
}

unsigned int ports_to_normal_address(unsigned int ports)
{
    unsigned int A = (ports >> 16) & 0xff;
    unsigned int B = (ports >>  8) & 0xff;
    unsigned int C = (ports >>  0) & 0xff;
    unsigned int address = 0;
    for(int i = 0; i < address_line_count; i++) {
        GPIOLine* line = &address_lines[i];
        int bit;
        if(line->gpio == GPIOA)
            bit = (A >> line->pin) & 1;
        else if(line->gpio == GPIOB)
            bit = (B >> line->pin) & 1;
        else if(line->gpio == GPIOC)
            bit = (C >> line->pin) & 1;
        address = address | (bit << i);
    }
    return address;
}

unsigned int ports_to_shuffled_address(unsigned int ports)
{
    unsigned int A = (ports >> 16) & 0xff;
    unsigned int B = (ports >>  8) & 0xff;
    unsigned int C = (ports >>  0) & 0xff;
    return BUS_compute_shuffled_ADDRESS(A, B, C);
}

void check_exceptional_conditions()
{
    if(gConsoleOverflowed) {
        logprintf(DEBUG_WARNINGS, "WARNING: Console input queue overflow\n");
        gConsoleOverflowed = 0;
    }

    if(gKeyboardOverflowed) {
        logprintf(DEBUG_WARNINGS, "WARNING: Keyboard data queue overflow\n");
        gKeyboardOverflowed = 0;
    }

    if(gReadWasAlreadyInactive) {
        logprintf(DEBUG_WARNINGS, "A");
        gReadWasAlreadyInactive = 0;
    }

    if(DEBUG_BUS_ISR && gUnclaimedRead) {
        BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, '*' + 128);
        logprintf(DEBUG_WARNINGS, "R(%04X or %04X)", 
            ports_to_normal_address(gUnclaimedReadAddressPins),
            ports_to_shuffled_address(gUnclaimedReadAddressPins));
        gUnclaimedRead = 0;
    }

    if(DEBUG_BUS_ISR && gUnclaimedWrite) {
        BUS_write_IO(VIDEO_BOARD_OUTPUT_ADDR, '*' + 128);
        logprintf(DEBUG_WARNINGS, "W(%04X or %04X,%02X,%d)",
            ports_to_normal_address(gUnclaimedWriteAddressPins),
            ports_to_shuffled_address(gUnclaimedWriteAddressPins),
            gUnclaimedWriteData, gUnclaimedWrite);
        gUnclaimedWrite = 0;
    }

    if(gKeyboardParityError) {
        logprintf(DEBUG_WARNINGS, "WARNING: Keyboard data parity error, received 0x%02X\n", gKeyboardParityError - 256);
        gKeyboardParityError = 0;
    }

    if(gKeyboardBATBadParity) {
        logprintf(DEBUG_EVENTS, "EVENT: Received initial BAT with parity error from PS/2 keyboard\n");
        gKeyboardBATBadParity = 0;
    }
}

void process_monitor_queue()
{
    unsigned char isEmpty = queue_isempty(&mon_queue.q);
    static unsigned char escapeBackToMonitor = 0;

    if(!isEmpty) {
        unsigned char c = queue_deq(&mon_queue.q);
        if(gSerialInputToMonitor)
            process_local_key(c);
        else {
            if(escapeBackToMonitor == 0 && c == 1)
                escapeBackToMonitor = 1;
            else if(escapeBackToMonitor != 0 && c == 2) {
                escapeBackToMonitor = 0;
                gSerialInputToMonitor = 1;
                printf("Serial input returned to monitor\n");
            } else {
                escapeBackToMonitor = 0;
                disable_interrupts();
                console_enqueue_key_unsafe(c);
                enable_interrupts();
            }
        }
    }
}

int read_bootrom()
{
    FIL f;
    FRESULT result = f_open (&f, "bootrom.bin", FA_READ | FA_OPEN_EXISTING);

    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't open \"bootrom.bin\" for reading, FatFS result %d\n", result);
        return 0;
    }

    gZ80BootImageLength = f_size(&f);

    gZ80BootImage = (unsigned char*)malloc(gZ80BootImageLength);
    if(gZ80BootImage == NULL) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't allocate %lu bytes to read Z80 boot image\n", gZ80BootImageLength);
        return 0;
    }

    UINT wasread;
    result = f_read(&f, gZ80BootImage, gZ80BootImageLength, &wasread);
    if(result != FR_OK) {
        logprintf(DEBUG_ERRORS, "ERROR: couldn't read from \"bootrom.bin\", FatFS result %d\n", result);
        free(gZ80BootImage);
        gZ80BootImage = NULL;
        return 0;
    }

    if(wasread != gZ80BootImageLength) {
        logprintf(DEBUG_ERRORS, "ERROR: tried to read %lu bytes, only read %ld\n", gZ80BootImageLength, wasread);
        free(gZ80BootImage);
        gZ80BootImage = NULL;
        return 0;
    }

    f_close(&f);
    return 1;
}

void uart_received(char c)
{
    queue_enq(&mon_queue.q, c);
}

void console_queue_init()
{
    queue_init(&con_queue.q, CON_QUEUE_CAPACITY);
}

int main()
{
    system_init();

    LED_init();
    LED_beat_heart();

    MON_init();
    console_queue_init();
    LED_beat_heart();

    setbuf(stdout, NULL);

    SERIAL_init(); // transmit and receive but global interrupts disabled
    LED_beat_heart();

    printf("\n\nAlice 3 I/O firmware, %s\n", IOBOARD_FIRMWARE_VERSION_STRING);
    printf("System core clock: %lu MHz\n", SystemCoreClock / 1000000);

    LED_beat_heart();
    SERIAL_flush();

    RESET_BUTTON_init();

    IOSERVICE_clear_command();
    IOSERVICE_clear_response();

    if(gStandaloneARM) {

        printf("ARM in standalone mode; won't use Propeller or Z80.\n");

    } else {

        VIDEO_init();
        VIDEO_wait();

	// Pulls Z80 RESET low (active), but Z80 may not actually
	// reset until some clock cycles have run.  So run clock below
	// before trying to access bus.  (As of Apr 6, 2016, the Prop runs
        // Z80 clock continuously...)

        BUS_init();

        VIDEO_start_clock();
        VIDEO_output_string("Alice 3 I/O firmware, " IOBOARD_FIRMWARE_VERSION_STRING "\r\n", 0);

        if((ALICE3_VERSION == ALICE3_V3) && !ALICE3_V3_ARM_IS_RAM) {
            printf("RAM check...\n");
            SERIAL_flush();
            if(!BUS_check_RAM()) {
                panic();
            }
            printf("RAM okay...\n");
            SERIAL_flush();
        }

